# Recommender system combination style

Both of the other lists had good film recommendations but with their own seperate weaknesses. Therefore it seems logcal to put the two lists together to give a final list.

In [1]:
# import modules and data

import pandas as pd
import numpy as np

regression_df = pd.read_csv('regression_films.csv')

nlp_series = pd.read_csv('nlp_films.csv')

print(nlp_series.shape)
print(regression_df.shape)

(63377, 2)
(63377, 23)

In [2]:
# quick look at the data

regression_df.head(3)

,Id,title,original_title,year,date_published,genre,duration,country,language,director,...,description,avg_vote,votes,budget,usa_gross_income,worlwide_gross_income,metascore,reviews_from_users,reviews_from_critics,response
0,tt2788710,The Interview,The Interview,2014,2014-12-24,"Action, Adventure, Comedy",112,USA,"English, Korean","Evan Goldberg, Seth Rogen",...,Dave Skylark and his producer Aaron Rapaport r...,6.5,301891,$ 44000000,$ 6105175,$ 11782625,52.0,929.0,301.0,2.176884
1,tt0106226,L'età dell'innocenza,The Age of Innocence,1993,1993-09-10,"Drama, Romance",139,USA,"English, Italian",Martin Scorsese,...,A tale of nineteenth-century New York high soc...,7.2,50690,$ 34000000,$ 32255440,$ 32255440,90.0,186.0,73.0,2.119740
2,tt6320628,Spider-Man: Far from Home,Spider-Man: Far from Home,2019,2019-07-10,"Action, Adventure, Sci-Fi",129,USA,"English, Italian, Czech",Jon Watts,...,Following the events of,7.5,304708,$ 160000000,$ 390532085,$ 1131927996,69.0,2041.0,415.0,2.039769

In [3]:
nlp_series.head(3)

   Unnamed: 0          0
0           0  tt0083564
1           1  tt0089123
2           2  tt0083693

In [4]:
# define the function for adding the two dataframes together

def add_index(row):
    idx = regression_df[regression_df['Id'] == row[1]].index.values[0]
    return idx + row[0]

In [5]:
# apply the function

nlp_series['new_id'] = nlp_series.apply(add_index, axis=1)

nlp_series.head()

   Unnamed: 0          0  new_id
0           0  tt0083564    5140
1           1  tt0089123   35459
2           2  tt0083693   31674
3           3  tt0079891   30412
4           4  tt0076694   30446

In [6]:
# sort the films by the new index

nlp_series = nlp_series.sort_values(by='new_id')

nlp_series.head()

     Unnamed: 0          0  new_id
31           31  tt0084714     237
308         308  tt0082245     411
250         250  tt0084691     493
78           78  tt0086904     509
434         434  tt0086036     661

In [24]:
# create an iterable list of the new films

film_id = list(nlp_series.iloc[:,1])

# create an empty series

final_list = pd.Series([0]*nlp_series.shape[0])

# print the films
i=0
for film in film_id:
    final_list[i] = regression_df[regression_df['Id'] == film].iloc[0,2]
    i+=1

0                       Split Image
1                   Deadly Blessing
2                         Six Weeks
3                   Another Country
4                 Of Unknown Origin
                    ...
63372                     Vanamagan
63373                Morto Não Fala
63374          The Midnight Matinee
63375    Amityville: Mt. Misery Rd.
63376            Huang jin xiong di
Length: 63377, dtype: object

In [25]:
final_list.head(20)

0                 Split Image
1             Deadly Blessing
2                   Six Weeks
3             Another Country
4           Of Unknown Origin
5                       Krull
6     Pee-wee's Big Adventure
7                   Christine
8       The Turn of the Screw
9                 The Goonies
10                Quicksilver
11       Children of the Corn
12                     Masoom
13                    Missing
14                    Agoniya
15                 Blood Song
16                  Quiz Show
17                        Pin
18           Just Before Dawn
19          Hospital Massacre
dtype: object